require 'jcode'
$KCODE='e'

STANDARD = [
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"",
	"9客 ¨录录录录录系系狸晤",
	"10客¨录录录录录系系狸晤陡",
	"11客¨录录录录录系系狸晤陡柬",
	"12客¨录录录录录录系系狸晤陡柬",
	"13客¨录录录录录录录系系狸晤陡柬",
	"14客¨录录录录录录录录系系狸晤陡柬",
	"15客¨录录录录录录录录系系系狸晤陡柬",
	"16客¨录录录录录录录系系系狸晤陡柬鼎鼎",
	"17客¨录录录录录录录录系系系狸晤陡柬鼎鼎",
	"18客¨录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"19客¨录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"20客¨录录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"21客¨录录录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"22客¨录录录录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"23客¨录录录录录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"24客¨录录录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎",
	"25客¨录录录录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎",
	"26客¨录录录录录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎"
]

YOUMA = [
	"",
	"",
	"",
	"",
	"",
	"",
	"6客 ¨录录录系狸团",
	"7客 ¨录录录录系狸团",
	"8客 ¨录录录录系系狸团",
	"9客 ¨录录录录系系狸晤团",
	"10客¨录录录录系系狸晤陡团",
	"11客¨录录录录系系狸晤陡柬团",
	"12客¨录录录录录系系狸晤陡柬团",
	"13客¨录录录录录录系系狸晤陡柬团",
	"14客¨录录录录录录录系系狸晤陡柬团",
	"15客¨录录录录录录录系系系狸晤陡柬团",
	"16客¨录录录录录录系系系狸晤陡柬鼎鼎团",
	"17客¨录录录录录录录系系系狸晤陡柬鼎鼎团",
	"18客¨录录录录录录录录系系系狸晤陡柬鼎鼎团",
	"19客¨录录录录录录录录录系系系狸晤陡柬鼎鼎团",
	"20客¨录录录录录录录录录录系系系狸晤陡柬鼎鼎团",
	"21客¨录录录录录录录录录录录系系系狸晤陡柬鼎鼎团",
	"22客¨录录录录录录录录录录录录系系系狸晤陡柬鼎鼎团",
	"23客¨录录录录录录录录录录录录录系系系狸晤陡柬鼎鼎团",
	"24客¨录录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎团",
	"25客¨录录录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎团",
	"26客¨录录录录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎团"
]

CUPID = [
	"",
	"",
	"",
	"",
	"",
	"",
	"6客 ¨录录录系狸滇",
	"7客 ¨录录录录系狸滇",
	"8客 ¨录录录录系系狸滇",
	"9客 ¨录录录录系系狸晤滇",
	"10客¨录录录录系系狸晤陡Ｑ",
	"11客¨录录录录系系狸晤陡柬Ｑ",
	"12客¨录录录录录系系狸晤陡柬Ｑ",
	"13客¨录录录录录录系系狸晤陡柬Ｑ",
	"14客¨录录录录录录录系系狸晤陡柬Ｑ",
	"15客¨录录录录录录录系系系狸晤陡柬Ｑ",
	"16客¨录录录录录录系系系狸晤陡柬鼎鼎Ｑ",
	"17客¨录录录录录录录系系系狸晤陡柬鼎鼎Ｑ",
	"18客¨录录录录录录录录系系系狸晤陡柬鼎鼎Ｑ",
	"19客¨录录录录录录录录录系系系狸晤陡柬鼎鼎Ｑ",
	"20客¨录录录录录录录录录录系系系狸晤陡柬鼎鼎Ｑ",
	"21客¨录录录录录录录录录录录系系系狸晤陡柬鼎鼎Ｑ",
	"22客¨录录录录录录录录录录录系系系系狸晤陡柬鼎鼎Ｑ",
	"23客¨录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎Ｑ",
	"24客¨录录录录录录录录录录录录录系系系系狸晤陡柬鼎鼎Ｑ"
]

CATTLE = [
	"",
	"",
	"",
	"",
	"4客 ¨录系狸陡",
	"5客 ¨录录系狸陡",
	"6客 ¨录录录系狸陡",
	"7客 ¨录录录录系狸陡",
	"8客 ¨录录录录系系狸柬",
	"9客 ¨录录录录录系系狸柬",
	"10客¨录录录录系系狸晤陡柬",
	"11客¨录录录录录系系狸晤陡柬",
	"12客¨录录录录录录系系狸晤陡柬",
	"13客¨录录录录录录录系系狸晤陡柬",
	"14客¨录录录录录录录录系系狸晤陡柬",
	"15客¨录录录录录录录录录系系狸晤陡柬",
	"16客¨录录录录录录录系系系狸晤陡柬鼎鼎",
	"17客¨录录录录录录录录系系系狸晤陡柬鼎鼎",
	"18客¨录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"19客¨录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"20客¨录录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"21客¨录录录录录录录录录录录录系系系狸晤陡柬鼎鼎",
	"22客¨录录录录录录录录录录录录录系系系狸晤陡柬鼎鼎"
]

RDM = '狸系'

class Composition
	attr_reader :name, :list, :min, :max

	def initialize(name, list, min, max)
		@name = name
		@list = list
		@min = min
		@max = max
	end

	def Composition.compositions
		@@compositions
	end

	def Composition.display(comp_i)
		s = ''
		comp = @@compositions[comp_i]
		for i in comp.min..comp.max do
			s += "#{comp.list[i]}<br>"
		end
		s
	end

	a = Array.new
	a.push(Composition.new('カスタム', nil, nil, nil)) # 0
	a.push(Composition.new('筛洁', STANDARD, 9, 26)) # 1
	a.push(Composition.new('团蒜', YOUMA, 6, 26)) # 2
	a.push(Composition.new('キュ〖ピッド', CUPID, 6, 24)) # 3
	a.push(Composition.new('淀录', CATTLE, 4, 22)) # 4
	a.push(Composition.new('抨蛊', nil, 4, 22)) # 5
	a.push(Composition.new('ワイドカスタム', nil, 4, 22)) # 6
  a.push(Composition.new('ランダム', RDM, 4, 99)) # 7
	@@compositions = a
end

class Skill
	attr_accessor :name, :default_num, :position, :sname

	def initialize(name, default_num, position, sname)
		@name = name
    	@default_num = default_num
		@position = position
		@sname = sname
	end

	def Skill.skills
		@@skills
	end

	def Skill.num_skill
		@@num_skill
	end

	a = Array.new
	a.push(Skill.new('录客', 3, '录客', '录')) # 0
	a.push(Skill.new('客系', 2, '客系', '系')) # 1
	a.push(Skill.new('狸い徽', 1, '录客', '狸')) # 2
	a.push(Skill.new('晤墙荚', 1, '录客', '晤')) # 3
	a.push(Skill.new('陡客', 1, '客系', '陡')) # 4
	a.push(Skill.new('柬客', 0, '录客', '柬')) # 5
	a.push(Skill.new('鼎铜荚', 0, '录客', '鼎')) # 6
	a.push(Skill.new('团蒜', 0, '团蒜', '团')) # 7
	a.push(Skill.new('Ｃ柜陡客', 0, '客系', 'Ｃ')) # 8
	a.push(Skill.new('陡慨荚', 0, '客系', '慨')) # 9
	a.push(Skill.new('阑函荚', 0, '录客', '阑')) # 10
	a.push(Skill.new('面咳狸い徽', 0, '录客', '面')) # 11
	a.push(Skill.new('キュ〖ピッド', 0, '硒客', 'Ｑ')) # 12
	a.push(Skill.new('滇唉荚', 0, '硒客', '滇')) # 13
	a.push(Skill.new('假蒜陡客', 0, '客系', '假')) # 14
	a.push(Skill.new('哙磅荚', 0, '录客', '哙')) # 15
	a.push(Skill.new('慎丸柬客', 0, '录客', '慎')) # 16
  a.push(Skill.new('冷滦荚', 0, '录客', '冷')) # 17
  a.push(Skill.new('冷滦客系', 0, '客系', 'Ｚ')) # 18
	@@skills = a
end

